Ran Plan for dir: `_infra` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.b2 has been deleted
- resource "aws_s3_bucket" "b2" {
      - acl                = "public-read" -> null
      - bucket             = "mybucket" -> null
      - bucket_domain_name = "mybucket.s3.amazonaws.com" -> null
      - force_destroy      = false -> null
      - id                 = "mybucket" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.dogs will be created
+ resource "aws_dynamodb_table" "dogs" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "ID"
      + id               = (known after apply)
      + name             = "dogs2"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "ID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # aws_instance.web2 will be updated in-place
~ resource "aws_instance" "web2" {
        id                           = "i-fd12e20744c117fe3"
      ~ instance_type                = "m5.8xlarge" -> "m5.4xlarge"
        tags                         = {
            "Name" = "HelloWorld2"
        }
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.b23 will be created
+ resource "aws_s3_bucket" "b23" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "mybucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_sqs_queue.terraform_queue will be updated in-place
~ resource "aws_sqs_queue" "terraform_queue" {
        id                                = "http://localhost:4566/000000000000/terraform-example-queue"
        name                              = "terraform-example-queue"
      ~ tags                              = {
          ~ "Environment" = "foobar" -> "foobr"
        }
      ~ tags_all                          = {
          ~ "Environment" = "foobar" -> "foobr"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
2021/12/08 10:25:38 [DEBUG] DELETE http://host.docker.internal:8000/api/v1/project/12345/terraform/state/unlock/terraform.lock

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d _infra`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d56d-2a02-c7e-2c31-4b00-5199-5a41-f664-7372.ngrok.io/lock?id=nassergonzalez%252Finfra-test%252F_infra%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d _infra`
</details>
Plan: 2 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
